#include <iostream>
#include <cmath>
#include <vector>

using namespace std;

int main()
{
        //Дано целое число в диапазоне 100–999. Вывести строку-описание
        //данного числа, например: 256 — «двести пятьдесят шесть», 814 — «во-
        //семьсот четырнадцать».
        int a;
        cin >> a;
        const char* dig[]={ "один", "два", "три", "четыре", "пять", "шесть",
        "семь", "восемь", "девять"};
        const char* ell[]={ "десять","одиннадцать", "двенадцать", "тринадцать", "четырнадцать",
        "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
        const char* dec[]={ "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят",
        "семьдесят", "восемьдесят", "девяносто" };
        const char* hun[]={ "сто ", "двести ", "триста ", "четыреста ", "пятьсот ", "шестьсот ",
        "семьсот ", "восемьсот ", "девятьсот " };
        
        int c=a%10;
        a/=10;
        int b=a%10;
        a/=10;
        
        cout << hun[a-1];
        if (b==0&&c==0){
          return 0;
        }
        if (b==0&&c!=0){
          cout << dig[c-1];
        } else if (b!=0&&c==0){
          cout << dec[b-2];
        } else if (b==1){
          cout << ell[b];
        } else {
          cout << dec[b-2] << " " << dig[c-1];
        }
        
	return 0;
}
