#include <iostream>
#include <cmath>
#include <vector>

using namespace std;

int main()
{
        //Даны два целых числа: D (день) и M (месяц), определяющие правиль-
        //ную дату. Вывести знак Зодиака, соответствующий этой дате: «Водолей»
        //(20.1–18.2), «Рыбы» (19.2–20.3), «Овен» (21.3–19.4), «Телец» (20.4–20.5),
        //«Близнецы» (21.5–21.6), «Рак» (22.6–22.7), «Лев» (23.7–22.8), «Дева»
        //(23.8–22.9), «Весы» (23.9–22.10), «Скорпион» (23.10–22.11), «Стрелец»
        //(23.11–21.12), «Козерог» (22.12–19.1)
        int d,m;
        cin >> d >> m;
        d+=m*30;
        //FUCK CASE I HATE IT
        //I LOVE IF AND FOR
        if (d>=50&&d<=78){
          cout << "Водолей";
        }
        if (d>=79&&d<=110){
          cout << "Рыбы";
        }
        if (d>=111&&d<=139){
          cout << "Овен";
        }
        if (d>=140&&d<=170){
          cout << "Телец";
        }
        if (d>=171&&d<=201){
          cout << "Близнецы";
        }
        if (d>=202&&d<=232){
          cout << "Рак";
        }
        if (d>=233&&d<=262){
          cout << "Лев";
        }
        if (d>=263&&d<=292){
          cout << "Дева";
        }
        if (d>=293&&d<=322){
          cout << "Весы";
        }
        if (d>=323&&d<=352){
          cout << "Скорпион";
        }
        if (d>=353&&d<=381){
          cout << "Стрелец";
        }
        if (d>=382||d<=49){
          cout << "Козерог";
        }
	return 0;
}
