#include <iostream>
#include <cmath>
#include <vector>

using namespace std;

int main()
{
	//Дана масса M в килограммах. Используя операцию деления нацело,
	//найти количество полных тонн в ней (1 тонна = 1000 кг).
	int m;
	cin >> m;
	cout << m/1000 << endl;
	return 0;
}
